[{"word":"wicks","phonetics":[],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A bundle, twist, braid, or woven strip of cord, fabric, fibre/fiber, or other porous material in a candle, oil lamp, kerosene heater, or the like, that draws up liquid fuel, such as melted tallow, wax, or the oil, delivering it to the base of the flame for conversion to gases and burning; any other length of material burned for illumination in small successive portions.","synonyms":[],"antonyms":[],"example":"Trim the wick fairly short, so that the flame does not smoke."},{"definition":"Any piece of porous material that conveys liquid by capillary action, such as a strip of gauze placed in a wound to serve as a drain.","synonyms":[],"antonyms":[]},{"definition":"A narrow opening in the field, flanked by other players' stones.","synonyms":[],"antonyms":[]},{"definition":"A shot where the played stone touches a stationary stone just enough that the played stone changes direction.","synonyms":[],"antonyms":[]},{"definition":"The penis.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To convey or draw off (liquid) by capillary action.","synonyms":[],"antonyms":[],"example":"The fabric wicks perspiration away from the body."},{"definition":"(of a liquid) To traverse (i.e. be conveyed by capillary action) through a wick or other porous material, as water through a sponge. Usually followed by through.","synonyms":[],"antonyms":[],"example":"The moisture slowly wicked through the wood."},{"definition":"To strike (a stone) obliquely; to strike (a stationary stone) just enough that the played stone changes direction.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A village; hamlet; castle; dwelling; street; creek; bay; harbour; a place of work, jurisdiction, or exercise of authority.","synonyms":[],"antonyms":[]},{"definition":"A farm, especially a dairy farm.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A corner of the mouth or eye.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/wick","https://en.wiktionary.org/wiki/wicks"]}]