[{"word":"specs","phonetic":"/spɛks/","phonetics":[{"text":"/spɛks/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"Two similar or identical things taken together; often followed by of.","synonyms":[],"antonyms":[],"example":"I couldn't decide which of the pair of designer shirts I preferred, so I bought the pair."},{"definition":"Two people in a relationship, partnership or friendship.","synonyms":[],"antonyms":[],"example":"Spouses should make a great pair."},{"definition":"Used with binary nouns (often in the plural to indicate multiple instances, since such nouns are plural only, except in some technical contexts)","synonyms":[],"antonyms":[],"example":"a pair of scissors; two pairs of spectacles; several pairs of jeans"},{"definition":"A couple of working animals attached to work together, as by a yoke.","synonyms":[],"antonyms":[],"example":"A pair is harder to drive than two mounts with separate riders."},{"definition":"A poker hand that contains two cards of identical rank, which cannot also count as a better hand.","synonyms":[],"antonyms":[]},{"definition":"A score of zero runs (a duck) in both innings of a two-innings match.","synonyms":["pair of spectacles","spectacles"],"antonyms":[]},{"definition":"A double play, two outs recorded in one play.","synonyms":[],"antonyms":[],"example":"They turned a pair to end the fifth."},{"definition":"A doubleheader, two games played on the same day between the same teams","synonyms":[],"antonyms":[],"example":"The Pirates took a pair from the Phillies."},{"definition":"A boat for two sweep rowers.","synonyms":[],"antonyms":[]},{"definition":"A pair of breasts","synonyms":[],"antonyms":[],"example":"She's got a gorgeous pair."},{"definition":"The exclusion of one member of a parliamentary party from a vote, if a member of the other party is absent for important personal reasons.","synonyms":[],"antonyms":[]},{"definition":"Two members of opposite parties or opinion, as in a parliamentary body, who mutually agree not to vote on a given question, or on issues of a party nature during a specified time.","synonyms":[],"antonyms":[],"example":"There were two pairs on the final vote."},{"definition":"A number of things resembling one another, or belonging together; a set.","synonyms":[],"antonyms":[]},{"definition":"(kinematics) In a mechanism, two elements, or bodies, which are so applied to each other as to mutually constrain relative motion; named in accordance with the motion it permits, as in turning pair, sliding pair, twisting pair.","synonyms":[],"antonyms":[]}],"synonyms":["pair of spectacles","spectacles"],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A special place (for hiding or viewing)","synonyms":[],"antonyms":[]},{"definition":"A spectacular mark (catch) in Australian rules football.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A reduction in consumer cost (usually for a limited time) for items or services rendered.","synonyms":[],"antonyms":[],"example":"We're running a special on turkey for Thanksgiving."},{"definition":"One of a rotation of meals systematically offered for a lower price at a restaurant.","synonyms":[],"antonyms":[],"example":"Today's special is our tuna melt on rye."},{"definition":"Unusual or exceptional episode of a series.","synonyms":[],"antonyms":[],"example":"Did you see the Christmas special?"},{"definition":"A special constable.","synonyms":[],"antonyms":[]},{"definition":"Anything that is not according to normal practice, plan, or schedule, as an unscheduled run of transportation that is normally scheduled.","synonyms":[],"antonyms":[],"example":"Thousands came to see the special that carried the President's coffin."},{"definition":"Any unlicensed medicine produced or obtained for a specific individual patient.","synonyms":[],"antonyms":[]},{"definition":"A correspondent; a journalist sent to the scene of an event to report back.","synonyms":[],"antonyms":[]},{"definition":"A dispatch sent back by a special correspondent.","synonyms":[],"antonyms":[]},{"definition":"A light that illuminates a specific person or thing on the stage.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"Someone who is an expert in, or devoted to, some specific branch of study or research.","synonyms":["aficionado","connoisseur","enthusiast"],"antonyms":[]},{"definition":"A physician whose practice is limited to a particular branch of medicine or surgery.","synonyms":[],"antonyms":[]},{"definition":"Any of several non-commissioned ranks corresponding to that of corporal.","synonyms":[],"antonyms":[]},{"definition":"An organism that is specialized for a particular environment.","synonyms":[],"antonyms":[],"example":"The tree Lepidothamnus laxifolius is a high alpine specialist found in high-altitude bog communities and in scrub."}],"synonyms":["aficionado","connoisseur","enthusiast"],"antonyms":["generalist"]},{"partOfSpeech":"noun","definitions":[{"definition":"The act or process of specializing.","synonyms":[],"antonyms":[]},{"definition":"The area in which someone specializes.","synonyms":[],"antonyms":[]},{"definition":"The adaptation of an organism to a specific environment, or adaptation of an organ to a particular function.","synonyms":[],"antonyms":[]},{"definition":"A proof, axiom, problem, or definition whose cases are completely covered by another, broader concept.","synonyms":[],"antonyms":[],"example":"A triangle is a specialization of a polygon to one with exactly three sides."}],"synonyms":["particularization"],"antonyms":["abstraction","generalization"]},{"partOfSpeech":"noun","definitions":[{"definition":"An explicit set of requirements to be satisfied by a material, product, or service.","synonyms":[],"antonyms":[]},{"definition":"An act of specifying.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A person or thing that specifies.","synonyms":[],"antonyms":[]},{"definition":"A component of a phrase that is non-recursive and not found as a sister of the head of the phrase, but rather as a daughter of the maximal projection of the phrase.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"A pair of lenses set in a frame worn on the nose and ears in order to correct deficiencies in eyesight or to ornament the face.","synonyms":[],"antonyms":[]}],"synonyms":["eyeglasses","glasses","pair of eyeglasses","pair of glasses","pair of specs","pair of spectacles","specs"],"antonyms":[]},{"partOfSpeech":"noun","definitions":[{"definition":"The process of thinking or meditating on a subject.","synonyms":[],"antonyms":[]},{"definition":"The act or process of reasoning a priori from premises given or assumed.","synonyms":[],"antonyms":[]},{"definition":"A conclusion to which the mind comes by speculating; mere theory; notion; conjecture.","synonyms":[],"antonyms":[]},{"definition":"An investment involving higher-than-normal risk in order to obtain a higher-than-normal return.","synonyms":[],"antonyms":[]},{"definition":"The act or practice of buying land, goods, shares, etc., in expectation of selling at a higher price, or of selling with the expectation of repurchasing at a lower price; a trading on anticipated fluctuations in price, as distinguished from trading in which the profit expected is the difference between the retail and wholesale prices, or the difference of price in different markets.","synonyms":[],"antonyms":[]},{"definition":"Examination by the eye; view.","synonyms":[],"antonyms":[]},{"definition":"Power of sight.","synonyms":[],"antonyms":[]},{"definition":"A card game in which the players buy from one another trumps or whole hands, upon a chance of getting the highest trump dealt, which entitles the holder to the pool of stakes.","synonyms":[],"antonyms":[]},{"definition":"The process of anticipating which branch of code will be chosen and executing it in advance.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/pair","https://en.wiktionary.org/wiki/spec","https://en.wiktionary.org/wiki/special","https://en.wiktionary.org/wiki/specialist","https://en.wiktionary.org/wiki/specialization","https://en.wiktionary.org/wiki/specification","https://en.wiktionary.org/wiki/specifier","https://en.wiktionary.org/wiki/specs","https://en.wiktionary.org/wiki/spectacles","https://en.wiktionary.org/wiki/speculation"]}]