[{"word":"flips","phonetic":"/flɪps/","phonetics":[{"text":"/flɪps/","audio":""}],"meanings":[{"partOfSpeech":"noun","definitions":[{"definition":"A maneuver which rotates an object end over end.","synonyms":[],"antonyms":[],"example":"The diver did a couple of flips before landing in the pool."},{"definition":"A complete change of direction, decision, movement etc.","synonyms":[],"antonyms":[]},{"definition":"A slingshot.","synonyms":[],"antonyms":[]},{"definition":"A hairstyle popular among boys in the 1960s–70s and 2000s–10s, in which the hair goes halfway down the ears, at which point it sticks out","synonyms":[],"antonyms":[],"example":"Justin Bieber and Zac Efron are among the celebrities who wore a flip."},{"definition":"The purchase of an asset (usually a house) which is then improved and sold quickly for profit.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]},{"partOfSpeech":"verb","definitions":[{"definition":"To throw so as to turn over.","synonyms":[],"antonyms":[],"example":"You need to flip the pancake onto the other side."},{"definition":"To put into a quick revolving motion through a snap of the thumb and index finger.","synonyms":[],"antonyms":[],"example":"If you can't decide which option to go for, flip a coin."},{"definition":"To win a state (or county) won by another party in the preceding elections","synonyms":[],"antonyms":[],"example":"Wisconsin had been Democratic for decades, but the Republicans flipped it in 2016."},{"definition":"To turn state's evidence; to agree to testify against one's co-conspirators in exchange for concessions from prosecutors.","synonyms":[],"antonyms":[],"example":"The mafioso flipped on his superiors to get a lighter sentence."},{"definition":"To induce someone to turn state's evidence; to get someone to agree to testify against their co-conspirators in exchange for concessions.","synonyms":[],"antonyms":[],"example":"The district attorney was able to strengthen his case against the bank robber by flipping the getaway driver."},{"definition":"To go berserk or crazy.","synonyms":[],"antonyms":[],"example":"I'd flip if anyone broke my phone."},{"definition":"To buy an asset (usually a house), improve it and sell it quickly for profit.","synonyms":[],"antonyms":[]},{"definition":"To invert a bit (binary digit), changing it from 0 to 1 or from 1 to 0.","synonyms":[],"antonyms":[]}],"synonyms":["toss","turn","turn over"],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/flip","https://en.wiktionary.org/wiki/flips"]}]